---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderFirstLegTooShortOrRunWidthTooGreatFailure
source: html/00481994-b5bf-018e-e1fb-268597f16440.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderFirstLegTooShortOrRunWidthTooGreatFailure Property

The first leg of winder run is too short or the runwidth is too great.

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderFirstLegTooShortOrRunWidthTooGreatFailure { get; }
```